[
    {
        "promocode": "WELCOME",
        "fullname": "Первый заказ",
        "description": {
            "full": "Никогда не поздно попробовать что-то новое! Если вы ещё не заказывали в нашей пиццерии, то приготовьтесь к приятному сюрпризу. Получите специальную скидку в размере 500 ₽ на свой первый заказ по промокоду <b>WELCOME</b>, чтобы окунуться в мир вкусной пиццы и других блюд от нашей команды.",
            "smart": "Скидка 500 ₽ по промокоду на весь заказ",
            "conditions": ["Отсутствует история заказов на аккаунте"]
        },
        "tech": {
            "type": "fix",
            "category": "all",
            "ratio": 500
        },
        "image": "welcome.webp"
    },
    {
        "promocode": "WATER",
        "fullname": "Тропическая жажда",
        "description": {
            "full": "Пора остудить свою жажду вкуснейшими напитками! Наше меню предлагает множество напитков на любой вкус: от освежающих лимонадов до ароматного кофе. По промокоду <b>WATER</b> вы можете получить скидку в размере 30% на все напитки в заказе. Насладитесь вкусом наших напитков и побалуйте себя вместе с нами!",
            "smart": "Скидка 30% по промокоду на все продукты из категории \"Напитки\"",
            "conditions": null
        },
        "tech": {
            "type": "percent",
            "category": "drinks",
            "ratio": 30
        },
        "image": "water.webp"
    },
    {
        "promocode": "LOVE",
        "fullname": "Пицца для двоих",
        "description": {
            "full": "Заказывайте пиццу вдвоём, используя промокод <b>LOVE</b>! Наслаждайтесь вкусом нашей аппетитной пиццы в компании любимого человека.",
            "smart": "Скидка 30% по промокоду на все продукты из категории \"Пиццы\"",
            "conditions": ["Семейный (двойной) аккаунт", "Два продукта из категории \"Пиццы\" в заказе (ни меньше, ни больше)"]
        },
        "tech": {
            "type": "percent",
            "category": "pizzas",
            "ratio": 30
        },
        "image": "love.webp"
    },
    {
        "promocode": "WORKER",
        "fullname": "Работник месяца",
        "description": {
            "full": "Дорогие сотрудники ресторана, мы ценим и уважаем вашу работу, а потому в нашей сети действует постоянный промокод <b>WORKER</b> для персонала в размере 30% на любой заказ. Продолжайте быть нашими героями и делайте наших гостей счастливыми. Спасибо вам!",
            "smart": "Скидка 30% по промокоду на весь заказ",
            "conditions": ["Подтверждённый аккаунт сотрудника \"ПиццаМаркет\""]
        },
        "tech": {
            "type": "percent",
            "category": "all",
            "ratio": 30
        },
        "image": "worker.webp"
    }
]
